In [1]:
import pandas as pd
df = pd.read_csv("train_and_test2.csv")
df.head()

,Passengerid,Age,Fare,Sex,sibsp,drop1,drop2,zero1,zero2,zero3,...,zero11,zero12,zero13,Pclass,zero14,zero15,Embarked,zero16,zero17,Survived
0,1,22.0,7.2500,0,1,0,1,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,1,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,1,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,1,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,1,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [2]:
df.drop(['Passengerid','sibsp','drop1','drop2','zero1','zero2','zero3','zero4','zero5','zero6','zero7','zero8','zero9','zero3','zero10','zero11','zero12','zero13','zero14','zero15','zero16','zero17','Parch','Embarked'],axis='columns', inplace=True) 
df.head()

    Age     Fare  Sex  Pclass  Survived
0  22.0   7.2500    0       3         0
1  38.0  71.2833    1       1         1
2  26.0   7.9250    1       3         1
3  35.0  53.1000    1       1         1
4  35.0   8.0500    0       3         0

In [5]:
target= df.Survived
inputs= df.drop('Survived',axis='columns')

In [10]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [28]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [13]:
len(X_train)

1047

In [14]:
len(X_test)

262

In [15]:
len(inputs)

1309

In [16]:
X_train

       Age      Fare  Sex  Pclass
753   23.0    7.8958    0       3
224   38.0   90.0000    0       1
1219  29.0   26.0000    0       2
511   28.0    8.0500    0       3
688   18.0    7.7958    0       3
...    ...       ...  ...     ...
808   39.0   13.0000    0       2
94    59.0    7.2500    0       3
581   39.0  110.8833    1       1
1265  54.0   81.8583    1       1
1152  21.0    7.8542    0       3

[1047 rows x 4 columns]

In [29]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [30]:
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [31]:
model.score(X_test, y_test)

0.7290076335877863

In [33]:
X_test[:10]

      Age      Fare  Sex  Pclass
234  24.0   10.5000    0       2
846  28.0   69.5500    0       3
947  35.0    7.8958    0       3
818  43.0    6.4500    0       3
530   2.0   26.0000    1       2
558  39.0   79.6500    1       1
3    35.0   53.1000    1       1
966  32.5  211.5000    0       1
41   27.0   21.0000    1       2
719  33.0    7.7750    0       3

In [36]:
y_test[:10]

234    0
846    0
947    0
818    0
530    1
558    1
3      1
966    0
41     0
719    0
Name: Survived, dtype: int64

In [35]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 1, 1, 1, 1, 0, 0], dtype=int64)

In [37]:
model.predict_proba(X_test[:10])

array([[0.92734546, 0.07265454],
       [0.93503324, 0.06496676],
       [0.96157422, 0.03842578],
       [0.96260934, 0.03739066],
       [0.49171592, 0.50828408],
       [0.27680041, 0.72319959],
       [0.36978436, 0.63021564],
       [0.01146165, 0.98853835],
       [0.61298063, 0.38701937],
       [0.9610429 , 0.0389571 ]])